# OnShutdown Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IEntryPoint..::..OnShutdown Method
IEntryPoint Interface See Also
---
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
void OnShutdown()
```

Visual Basic
---
```text
Sub OnShutdown
```

Visual C++
---
```text
void OnShutdown()
```

# See Also
IEntryPoint Interface
Autodesk.Revit.DB.Macros Namespace